#!/usr/bin/env python

import random
import logging


OBORONA = [
	[
		"солнечный",
		"траурный",
		"плюшевый",
		"бешеный",
		"памятный",
		"трепетный",
		"базовый",
		"скошенный",
		"преданный",
		"ласковый",
		"пойманный",
		"радужный",
		"огненный",
		"радостный",
		"тензорный",
		"шёлковый",
		"пепельный",
		"ламповый",
		"жареный",
		"загнанный",
		"липовый",
	],
	[
		"зайчик",
		"мячик",
		"страус",
		"глобус",
		"ветер",
		"щавель",
		"пёсик",
		"копчик",
		"ландыш",
		"стольник",
		"мальчик",
		"дольщик",
		"невод",
		"гонщик",
		"егерь",
		"пончик",
		"лобстер",
		"жемчуг",
		"кольщик",
		"овод",
		"вентиль",
	],
	[
		"стеклянного",
		"нелепого",
		"дешёвого",
		"ванильного",
		"резонного",
		"широкого",
		"горбатого",
		"собачьего",
		"исконного",
		"волшебного",
		"картонного",
		"лохматого",
		"арбузного",
		"огромного",
		"запойного",
		"великого",
		"бараньего",
		"вандального",
		"едрёного",
		"парадного",
		"шикарного",
	],
	[
		"глаза",
		"мира",
		"плова",
		"деда",
		"жира",
		"мема",
		"ада",
		"бура",
		"жала",
		"нёба",
		"гунна",
		"хлама",
		"шума",
		"воза",
		"сала",
		"фена",
		"зала",
		"рака",
		"кода",
		"луга",
		"мяса",
	]   
]

logger = logging.getLogger(__name__)


def get_oborona():
	logger.info("generating oborona")
	temp_oborona = []
	for ob in OBORONA:
		temp_oborona.append(random.choice(ob))
	return (" ".join(temp_oborona)).upper()


